import React from 'react';
import { Link } from 'react-router-dom';

const About = () => {
  return (
    <div className="">
      <h1>Про гру</h1>
      <img src="./db-repack/exports/67204651.png" />
      <text>
    
        Гра призначена для партнерів, що знову познайомилися і бажають зблизитися, для подружжя або
        пар, що вже склалися, адже звички - головний ворог близькості, а одноманітність вбиває
        любов. Допоможе перевести стосунки на принципово інший рівень, поглянути на коханого з
        іншого боку, «піділлє масла у вогонь», внісши свіжий струмінь у інтимне життя, що почало
        тьмяніти.
      </text>
      <button>
        <Link to="/home">Додому</Link>
      </button>
    </div>
  );
};

export default About;
